// Задача 65: Задайте значения M и N.
// Напишите программу, которая выведет все натуральные числа в промежутке от M до N.
// M = 1; N = 5 -> "1, 2, 3, 4, 5"
// M = 4; N = 8 -> "4, 5, 6, 7, 8"



int Prompt(string text)
{
    Console.WriteLine(text);
    return Convert.ToInt32(Console.ReadLine());
}


// int m = Prompt("Введите число m:");
// int n = Prompt("Введите число n");


void PowerRec(int m, int n)
{
    if (m == n)
        Console.Write(m);
    else
    {
        Console.Write(m + " ");
        PowerRec(m + 1, n);
    }
}
// PowerRec(m, n);

// ======================================================================================================

// Задача 67: Напишите программу, которая будет принимать на вход число и возвращать сумму его цифр.
// 453 -> 12
// 45 -> 9


// int m = Prompt("Введите число m:");

int Sum(int m)
{
    if (m == 0) return 0;

    return m % 10 + Sum(m / 10);
}

// Console.Write(Sum(m));


// ======================================================================================================

// Задача 69: Напишите программу, которая на вход принимает два числа A и B, 
// и возводит число А в целую степень B с помощью рекурсии.
// A = 3; B = 5 -> 243 (3⁵)
// A = 2; B = 3 -> 8


// int m = Prompt("Введите число m:");
// int n = Prompt("Введите число n");

int Prod(int m, int n)
{
    if (n == 0) return 1;
    return m * Prod(m, n - 1);
}
// Console.Write(Prod(m, n));